junke365/plc-studio/smart-plc-studio/packages/runtime/examples/stm32/main.c
        if (sent_len > 0) {
          HAL_UART_Transmit(&huart2, tx_buf, sent_len, 100);
        }

        /* 移除已处理的帧 */
        rx_pos -= frame_len;
        memmove(rx_buf, rx_buf + frame_len, rx_pos);
      }
    }

    vTaskDelay(pdMS_TO_TICKS(5));
  }
}

/* ========== main ========== */

int main(void)
{
  /* HAL 库初始化 */
  HAL_Init();

  /* 系统时钟 168MHz */
  SystemClock_Config();

  /* 外设初始化 */
  MX_GPIO_Init();
  MX_USART1_UART_Init();
  MX_USART6_DBG_UART_Init();
  MX_ADC1_Init();
  MX_DAC_Init();
  MX_TIM3_PWM_Init();
  MX_TIM6_Init();
  MX_SPI1_Init();

  /* 启动 TIM6（μs 基准） */
  HAL_TIM_Base_Start(&htim6);

  printf("\n========================================\n");
  printf(" Smart PLC Runtime — STM32F407\n");
  printf(" SYSCLK=%luMHz, %luKB Flash, %luKB RAM\n",
         HAL_RCC_GetSysClockFreq() / 1000000UL, 1024UL, 192UL);
  printf("========================================\n\n");

  /* ===== PLC 运行时初始化 ===== */

  plc_runtime_init(&g_runtime);

  /* 注册变量 */
  PlcVarTable* vt = plc_runtime_get_var_table(&g_runtime);
  plc_var_register(vt, "sensor_di_0", VAR_TYPE_BOOL, VAR_ATTR_INPUT,
                   sizeof(plc_bool), "数字量输入 0 (PB0)");
  plc_var_register(vt, "sensor_di_1", VAR_TYPE_BOOL, VAR_ATTR_INPUT,
                   sizeof(plc_bool), "数字量输入 1 (PB1)");
  plc_var_register(vt, "adc_ch_0", VAR_TYPE_UINT, VAR_ATTR_INPUT,
                   sizeof(plc_uint), "模拟量输入 0 (PA0, 12bit)");
  plc_var_register(vt, "relay_0", VAR_TYPE_BOOL, VAR_ATTR_OUTPUT,
                   sizeof(plc_bool), "继电器 0 (PC2, 高电平开)");
  plc_var_register(vt, "relay_1", VAR_TYPE_BOOL, VAR_ATTR_OUTPUT,
                   sizeof(plc_bool), "继电器 1 (PC3, 高电平开)");
  plc_var_register(vt, "pwm_0", VAR_TYPE_UINT, VAR_ATTR_OUTPUT,
                   sizeof(plc_uint), "PWM 输出 0 (PA6)");

  printf("[PLC] 已注册 %u 个变量\n", plc_var_count(vt));

  /* 配置 I/O 映射 */
  PlcIoConfig* io = plc_runtime_get_io_config(&g_runtime);
  plc_io_register(io, IO_TYPE_DI,  "DI_0",   "sensor_di_0", 0x10);
  plc_io_register(io, IO_TYPE_DI,  "DI_1",   "sensor_di_1", 0x11);
  plc_io_register(io, IO_TYPE_AI,  "AI_0",   "adc_ch_0",    0x00);
  plc_io_register(io, IO_TYPE_DO,  "DO_0",   "relay_0",     0x22); /* PC2 */
  plc_io_register(io, IO_TYPE_DO,  "DO_1",   "relay_1",     0x23); /* PC3 */
  plc_io_register(io, IO_TYPE_PWM, "PWM_0",  "pwm_0",       0x30);

  /* 绑定 I/O ↔ 变量 */
  for (uint16_t i = 0; i < io->channel_count; i++) {
    plc_io_bind(io, i, vt);
    printf("[PLC]   I/O %s → %s\n", io->channels[i].name, io->channels[i].var_name);
  }

  /* 加载并启动运行时 */
  plc_runtime_load(&g_runtime);
  plc_runtime_start(&g_runtime);

  printf("[PLC] 运行时已启动 (state=%d)\n", plc_runtime_get_state(&g_runtime));

  /* ===== 创建 FreeRTOS 任务 ===== */

  xTaskCreate(plc_scan_task, "PLC_Scan", 256, &g_runtime,
              configMAX_PRIORITIES - 1, NULL);
  xTaskCreate(comm_task, "Comm", 256, &g_runtime,
              configMAX_PRIORITIES - 2, NULL);
  xTaskCreate(debug_comm_task, "DbgComm", 512, &g_runtime,
              configMAX_PRIORITIES - 2, NULL);
  xTaskCreate(led_task, "LED", 128, NULL, 1, NULL);

  printf("[STM32] FreeRTOS 任务已创建 (4 tasks), 启动调度器...\n");

  /* 启动 FreeRTOS 调度器（永不返回） */
  vTaskStartScheduler();

  /* 异常: 调度器不应返回 */
  printf("[FATAL] 调度器异常返回!\n");
  for (;;);
}

/* ========== FreeRTOS 钩子 ========== */

void vApplicationStackOverflowHook(TaskHandle_t xTask, char* pcTaskName)
{
  (void)xTask;
  printf("[FATAL] 栈溢出! 任务: %s\n", pcTaskName);
  taskDISABLE_INTERRUPTS();
  for (;;);
}

void vApplicationMallocFailedHook(void)
{
  printf("[FATAL] 内存分配失败!\n");
  taskDISABLE_INTERRUPTS();
  for (;;);
}

void vApplicationIdleHook(void)
{
  /* 空闲时进入低功耗（可选） */
}
